Кура́тор	// - тот, кто наблюдает за ходом определённой работы или иным процессом

Студе́нт // - учащийся высшего, в некоторых странах и среднего учебного заведения.

Группа // - Академическая группа - группа, которая объединяет студентов определенного направления по времени обучения
   
Институт/Факультет // - Объединение кафедр университета.

Университет // -  высшее учебное заведение

Кафедра // -основная структурная единица факультета в высшем учебном заведении, осуществляющая подготовку слушателей, студентов и курсантов в рамках определённой специализации

Деканат/УМО // - в высших учебных заведениях организационный центр по управлению работой факультета, возглавляемый деканом/директором

Паспортные данные // - данные, определенные в паспорте

Паспорт // -государственный документ, удостоверяющий личность и гражданство владельца 

ФИО // - фамилия, имя и отчество

Дата и место рождения

Место регистрации и жительства // - место регистрации по паспорту, место жительства - место фактического жительства или пребывния

Серия и номер паспорта

Дата и место выдачи паспорта

Учебные данные // - совокупность данных. связанных с образованием

Номер студбилета/зачетки

Название группы 

Документ об образовании // - диплом профессионального образования или аттестат общего образования

Страховые данные // - данные. связанные со страхованием 

СНИЛС // - Страховой номер индивидуального лицевого счёта

ОМС // - обязательное медицинское страхование

Соц. данные // социальные данные - совокупность данных о человеке и его ближайших родственниках

Семейное положение // - женат/замужем, холост/не замужем

Близкие родственники // - опекуны, родители, супруги и дети

Статус семьи

Судимость // - правовое состояние гражданина, который был признан судом виновным в совершении преступления

Прочие данные // - данные. не включенные в вышеуказанные группы

Характеристика // - характеристика человека с места работы или учебы

Портфолио // - подтвержденные достижения человека

Номер пропуска

Номер трудовой книжки

Мед. книжка // - документ, подтвержающий обязательное медицинское освидетельствование
