Кура́тор	//- тот, кто наблюдает за ходом определённой работы или иным процессом

Студе́нт //- учащийся высшего, в некоторых странах и среднего учебного заведения.

Администратор //- физическое должностное лицо, управляющее в учреждении, коллективе, компании.

Социальная группа //— объединение людей, имеющих общий значимый социальный признак, основанный на их участии в некоторой деятельности, 

Компью́терная програ́мма //— комбинация компьютерных инструкций и данных, позволяющая аппаратному обеспечению вычислительной системы выполнять вычисления или функции управления.

Ба́за да́нных //— представленная в объективной форме совокупность самостоятельных материалов (статей, расчётов, нормативных актов, судебных решений и иных подобных материалов), систематизированных таким образом, чтобы эти материалы могли быть найдены и обработаны с помощью электронной вычислительной машины.

Систе́ма управле́ния ба́зами да́нных (СУБД) //— совокупность программных и лингвистических средств общего или специального назначения, обеспечивающих управление созданием и использованием баз данных.

Рассылка электронной почты //— средство массовой коммуникации, группового общения и рекламы, один из инструментов Интернет-маркетинга. Заключается в автоматизированной рассылке сообщений электронной почты группе адресатов по заранее составленному списку.

Шаблон //— в языках программирования, спецификация формы представления и правил редактирования элемента данных с помощью строки символов, в которой каждый символ указывает на допустимый вид символа или на подлежащее выполнению редактирование для соответствующей позиции значения элемента.

Администрирование //— управление, руководство, распоряжение.

Конфиденциа́льность //— необходимость предотвращения утечки (разглашения) какой-либо информации.

Клие́нт //— это аппаратный или программный компонент вычислительной системы, посылающий запросы серверу.

Се́рвер (англ. server от англ. to serve — служить, мн. ч. се́рверы) //— специализированный компьютер и/или специализированное оборудование для выполнения на нём сервисного программного обеспечения (в том числе серверов тех или иных задач), без непосредственного участия человека.

Лока́льная вычисли́тельная сеть (ЛВС, локальная сеть; англ. Local Area Network, LAN) //— компьютерная сеть, покрывающая обычно относительно небольшую территорию или небольшую группу зданий (дом, офис, фирму, институт).

Операционная система //— комплекс программ, обеспечивающий управление аппаратными средствами компьютера, организующий работу с файлами и выполнение прикладных программ, осуществляющий ввод и вывод данных.

SQL (ˈɛsˈkjuˈɛl; англ. structured query language — «язык структурированных запросов») //— язык программирования, применяемый для создания, модификации и управления данными в реляционной базе данных, управляемой соответствующей системой управления базами данных.	

Графи́ческий интерфе́йс по́льзователя (ГИП), графический пользовательский интерфейс (ГПИ) (англ. graphical user interface, GUI) //— разновидность пользовательского интерфейса, в котором элементы интерфейса (меню, кнопки, значки, списки и т. п.), представленные пользователю на дисплее, исполнены в виде графических изображений.

Авториза́ция (англ. authorization — разрешение, уполномочивание) //— предоставление определённому лицу или группе лиц прав на выполнение определённых действий; а также процесс проверки (подтверждения) данных прав при попытке выполнения этих действий.

Логин (англ. Login) //— имя (идентификатор) учётной записи пользователя в компьютерной системе, а также процедура входа (идентификации и затем аутентификации) пользователя в компьютерную систему, как правило, путём указания имени учётной записи и пароля.

Пароль (фр. parole — слово) //— условное слово или набор знаков, предназначенный для подтверждения личности или полномочий. Пароли часто используются для защиты информации от несанкционированного доступа.